#include <stdio.h>

int main()
{
  char str[101];
  int j,i,max;
   int count1[25] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
   int count2[25] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
   int count[25] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};

   printf("任意の文字列を入力してください。(100字以下)");
   scanf("%c",str);


   /*出現する文字の数を求める*/
   for(j = 0; str[j] != '\0'; j++)
     {
       if('a'<=str[j] && str[j]<='z') /*小文字のアルファベットの数を求める*/
	 count1[str[j] - '0']++;    
     else 
       if('A'<= str[j] && str[j]<='Z') /*大文字のアルファベットの数を求める*/
	   count2[str[j] - '0']++;
     }	
   for(i = 0; 0<=count[i] && count[i]<=25; i++) /*小文字と大文字のアルファベットの数の和を求める*/
     count[i] = count1[i] + count2[i];

   /*最も多く出現する文字の数を求める*/
   max = 0;

   for(i = 0;i < 25; i++)
     {
       if(max < count[i])
	 max = count[i];
     }  
 
   /*最も多く出現する文字とその数を求める*/
   printf("最頻出文字は %c\n ",max); 
   printf("出現回数は %d 回",max);  
   
   return 0;
}



