#include <stdio.h>

int sum_digit(int n); // 各桁の和を1桁にして返す関数

/* main()関数は変更しない */
int main(void)
{
  int i;
  int test[][2] = { /* 入力と正しい出力のペア*/
    {9,9},
    {10,1},
    {0,0},
    {55,1},
    {123,6},
    {128,2},
    {255,3},
    {123456789,9},
    {888888888,9},
    {2147483647,1},
    {-999,0} /* テストの終わり．このテストは実行されない */
  };

  i = 0;
  while (test[i][0] != -999){
    if (sum_digit(test[i][0]) == test[i][1])
      printf("テスト%d は成功\n",i+1);
    else{
      printf("テスト%d は失敗!!\n",i+1);
      printf("  作った関数の出力: %d\n",sum_digit(test[i][0]));
      printf("  期待される結果  : %d\n",test[i][1]);
    }

    i++;
  }
  return 0;
}

/* 以下の関数を変更する */
int sum_digit(int n)
// 各桁の和を求める関数．
// ただし和が2桁以上なら，さらに各桁の和を計算し，
// 1桁になるまで繰り返す．
{
  int a;

  a = b(n);
 
  while (a > 9)
    a = b(a);

  return a;
}

int b(int n)
{
  int c1, c2, c3, c4, c5, c6, c7, c8, c9, c10;/*ciはi桁目の整数*/
  c10 = n / 1000000000;
  c9 = (n - c10 * 1000000000) / 100000000;
  c8 = (n - c10 * 1000000000 - c9 * 100000000) / 10000000;
  c7 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000) / 1000000;
  c6 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000 - c7 * 1000000) / 100000;
  c5 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000 - c7 * 1000000 - c6 * 100000) / 10000;
  c4 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000 - c7 * 1000000 - c6 * 100000 - c5 * 10000) / 1000;
  c3 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000 - c7 * 1000000 - c6 * 100000 - c5 * 10000 - c4 * 1000) / 100;
  c2 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000 - c7 * 1000000 - c6 * 100000 - c5 * 10000 - c4 * 1000 - c3 * 100) / 10;
  c1 = (n - c10 * 1000000000 - c9 * 100000000 - c8 * 10000000 - c7 * 1000000 - c6 * 100000 - c5 * 10000 - c4 * 1000 - c3 * 100 - c2 * 10);
 
 return c1 + c2 + c3 + c4 + c5 + c6 + c7 + c8 + c9 + c10;
}



