#include <stdio.h>

int sum_digit(int n); // 各桁の和を1桁にして返す関数

/* main()関数は変更しない */
int main(void)
{
  int i;
  int test[][2] = { /* 入力と正しい出力のペア*/
    {9,9},
    {10,1},
    {0,0},
    {55,1},
    {123,6},
    {128,2},
    {255,3},
    {123456789,9},
    {888888888,9},
    {2147483647,1},
    {-999,0} /* テストの終わり．このテストは実行されない */
  };

  i = 0;
  while (test[i][0] != -999){
    if (sum_digit(test[i][0]) == test[i][1])
      printf("テスト%d は成功\n",i+1);
    else{
      printf("テスト%d は失敗!!\n",i+1);
      printf("  作った関数の出力: %d\n",sum_digit(test[i][0]));
      printf("  期待される結果  : %d\n",test[i][1]);
    }

    i++;
  }
  return 0;
}

/* 以下の関数を変更する */
int sum_digit(int n)
// 各桁の和を求める関数．
// ただし和が2桁以上なら，さらに各桁の和を計算し，
// 1桁になるまで繰り返す．
{
  int s;
   
  s = ketaf(n);

  while( s > 9)
    s = ketaf(s);

      return s;
}

int ketaf(int n)
{
  int p1, p2, p3, p4, p5, p6, p7, p8, p9, p10;

  p10 = n/1000000000;
  p9 = (n-p10*1000000000)/100000000;
  p8 = (n-p10*1000000000-p9*100000000)/10000000;
  p7 = (n-p10*1000000000-p9*100000000-p8*10000000)/1000000;
  p6 = (n-p10*1000000000-p9*100000000-p8*10000000-p7*1000000)/100000;
  p5 = (n-p10*1000000000-p9*100000000-p8*10000000-p7*1000000-p6*100000)/10000;
  p4 = (n-p10*1000000000-p9*100000000-p8*10000000-p7*1000000-p6*100000-p5*10000)/1000;
  p3 = (n-p10*1000000000-p9*100000000-p8*10000000-p7*1000000-p6*100000-p5*10000-p4*1000)/100;
  p2 = (n-p10*1000000000-p9*100000000-p8*10000000-p7*1000000-p6*100000-p5*10000-p4*1000-p3*100)/10;
  p1 = (n-p10*1000000000-p9*100000000-p8*10000000-p7*1000000-p6*100000-p5*10000-p4*1000-p3*100-p2*10);

  return p1 + p2 + p3 + p4 + p5 + p6 + p7 + p8 + p9 + p10;

}
