#include <stdio.h>

int sum_digit(int n); // 各桁の和を1桁にして返す関数

/* main()関数は変更しない */
int main(void)
{
  int i;
  int test[][2] = { /* 入力と正しい出力のペア*/
    {9,9},
    {10,1},
    {0,0},
    {55,1},
    {123,6},
    {128,2},
    {255,3},
    {123456789,9},
    {888888888,9},
    {2147483647,1},
    {-999,0} /* テストの終わり．このテストは実行されない */
  };

  i = 0;
  while (test[i][0] != -999){
    if (sum_digit(test[i][0]) == test[i][1])
      printf("テスト%d は成功\n",i+1);
    else{
      printf("テスト%d は失敗!!\n",i+1);
      printf("  作った関数の出力: %d\n",sum_digit(test[i][0]));
      printf("  期待される結果  : %d\n",test[i][1]);
    }

    i++;
  }
  return 0;
}

/* 以下の関数を変更する */
int sum_digit(int n)
// 各桁の和を求める関数．
// ただし和が2桁以上なら，さらに各桁の和を計算し，
// 1桁になるまで繰り返す．
{
  int sum;
  sum = sumplus(n);

  while (sum > 9)
    sum = sumplus(sum);


   return sum;
}

int sumplus(int n)
{
  int n1, n2, n3, n4, n5, n6, n7, n8, n9, n10; // ni  は i桁目の整数 

  n10 = n / 1000000000;
  n9 = n / 100000000 - n10 * 10;
  n8 = n / 10000000 - n10 * 100 - n9 * 10;
  n7 = n / 1000000 - n10 * 1000 - n9 * 100 - n8 * 10;
  n6 = n / 100000 - n10 * 10000 - n9 * 1000 - n8 * 100 - n7 * 10;
  n5 = n / 10000 - n10 * 100000 - n9 * 10000 - n8 * 1000 - n7 * 100 - n6 * 10;
  n4 = n / 1000 - n10 * 1000000 - n9 * 100000 - n8 * 10000 - n7 * 1000 - n6 * 100 - n5 * 10;
  n3 = n / 100 - n10 * 10000000 - n9 * 1000000 - n8 * 100000 - n7 * 10000 - n6 * 1000 - n5 * 100 - n4 * 10;
  n2 = n / 10 - n10 * 100000000 - n9 * 10000000 - n8 * 1000000 - n7 * 100000 - n6 * 10000 - n5 * 1000 - n4 * 100 - n3 * 10;
  n1 = n % 10;

  return n1 + n2 + n3 + n4 + n5 + n6 + n7 + n8 + n9 + n10;
}
