#include <stdio.h>
#include <string.h>

int sum_digit(int n); // 各桁の和を1桁にして返す関数

/* main()関数は変更しない */
int main(void)
{
   int i;
int test[][2] = { /* 入力と正しい出力のペア*/
   {9,9},
   {10,1},
   {0,0},
   {55,1},
   {123,6},
   {128,2},
   {255,3},
   {123456789,9},
   {888888888,9},
   {2147483647,1},
　　{-999,0} /* テストの終わり．このテストは実行されない */
};

i = 0;
while (test[i][0] != -999){
   if (sum_digit(test[i][0]) == test[i][1])
     printf("テスト%d は成功\n",i+1);
  else{
     printf("テスト%d は失敗!!\n",i+1);
     printf("  作った関数の出力: %d\n",sum_digit(test[i][0]));
     printf("  期待される結果  : %d\n",test[i][1]);
  }

  i++;
}
return 0;
}

/* 以下の関数を変更する */
int sum_digit(int no)
// 各桁の和を求める関数．
// ただし和が2桁以上なら，さらに各桁の和を計算し，
// 1桁になるまで繰り返す．
{

   int i=0,j=0,k=0;
   int a[100],b[100],c[100];

   if(no>=0&&9>=no)
      j=no;

   else if(no>=10&&99>=no){
      a[0]=(int)(no)%10;
      a[1]=(int)(no/10)%10;
      for(i=0;i<2;++i){
        j=j+a[i];
     }

     if(j>=10&&99>=j){
      b[0]=(int)(j)%10;
      b[1]=(int)(j/10)%10;
      j=0;
      for(i=0;i<2;++i){
        j=j+b[i];
     }         
  }
}

else if(no>=100&&999>=no){
   a[0]=(int)(no)%10;
   a[1]=(int)(no/10)%10;
   a[2]=(int)(no/10/10)%10;
   for(i=0;i<3;++i){
      j=j+a[i];
   }
   if(j>=10&&99>=j){
      b[0]=(int)(j)%10;
      b[1]=(int)(j/10)%10;
      j=0;
      for(i=0;i<2;++i){
         j=j+b[i];
      }
   }
}
else if(no>=100000000&&999999999>=no){
   a[0]=(int)(no)%10;
   a[1]=(int)(no/10)%10;
   a[2]=(int)(no/10/10)%10;
   a[3]=(int)(no/10/10/10)%10;
   a[4]=(int)(no/10/10/10/10)%10;
   a[5]=(int)(no/10/10/10/10/10)%10;
   a[6]=(int)(no/10/10/10/10/10/10)%10;
   a[7]=(int)(no/10/10/10/10/10/10/10)%10;
   a[8]=(int)(no/10/10/10/10/10/10/10/10)%10;
   for(i=0;i<9;++i){
      j=j+a[i];
   }
   if(j>=10&&99>=j){
      b[0]=(int)(j)%10;
      b[1]=(int)(j/10)%10;
      j=0;
      for(i=0;i<2;++i){
         j=j+b[i];
      }
   }
}
else {
   a[0]=(int)(no)%10;
   a[1]=(int)(no/10)%10;
   a[2]=(int)(no/10/10)%10;
   a[3]=(int)(no/10/10/10)%10;
   a[4]=(int)(no/10/10/10/10)%10;
   a[5]=(int)(no/10/10/10/10/10)%10;
   a[6]=(int)(no/10/10/10/10/10/10)%10;
   a[7]=(int)(no/10/10/10/10/10/10/10)%10;
   a[8]=(int)(no/10/10/10/10/10/10/10/10)%10;
   a[9]=(int)(no/10/10/10/10/10/10/10/10/10)%10;
   for(i=0;i<10;++i){
      j=j+a[i];
   }
   if(j>=10&&99>=j){
      b[0]=(int)(j)%10;
      b[1]=(int)(j/10)%10;
      j=0;
      for(i=0;i<2;++i){
         j=j+b[i];
      }

   }
   if(j>=10&&99>=j){
      c[0]=(int)(j)%10;
      c[1]=(int)(j/10)%10;
      j=0;
      for(i=0;i<2;++i){
         j=j+c[i];

      }
   }
}



return j;}

