#include <stdio.h>

int sum_digit(int n);
int tasizan(int n);
// 各桁の和を1桁にして返す関数
/* main()関数は変更しない */

int main(void)
{

  int i;
  int test[][2] = {
    /* 入力と正しい出力のペア*/
    {9,9},
    {10,1},
    {0,0},
    {55,1},
    {123,6},
    {128,2},
    {255,3},
    {123456789,9},
    {888888888,9},
    {2147483647,1},
    {-999,0} /* テストの終わり．このテストは実行されない */
  };
  i = 0;

  while (test[i][0] != -999){
    if (sum_digit(test[i][0]) == test[i][1])
      printf("テスト%d は成功\n",i+1);
    else{
      printf("テスト%d は失敗!!\n",i+1);
      printf("  作った関数の出力: %d\n",sum_digit(test[i][0]));
      printf("  期待される結果  : %d\n",test[i][1]);
    }
    i++;
  }
  return 0;
}

/* 以下の関数を変更する */
int sum_digit(int n)
// 各桁の和を求める関数．
// ただし和が2桁以上なら，さらに各桁の和を計算し，
// 1桁になるまで繰り返す．
{
  int sum;
}

int tasizan(int n)
{
  int d10, d9, d8, d7, d6, d5, d4, d3, d2, d1;

  d10 = n / 1000000000;
  d9 = (n - d10 * 1000000000) / 100000000;
  d8 = (n - d10 * 1000000000 - d9 * 100000000) / 10000000;
  d7 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000) / 1000000;
  d6 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000 - d7 * 1000000) / 100000;
  d5 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000 - d7 * 1000000 - d6 * 100000) / 10000;
  d4 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000 - d7 * 1000000 - d6 * 100000 - d5 * 10000) / 1000;
  d3 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000 - d7 * 1000000 - d6 * 100000 - d5 * 10000 - d4 * 1000) / 100;
  d2 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000 - d7 * 1000000 - d6 * 100000 - d5 * 10000 - d4 * 1000 - d3 * 100) / 10;
  d1 = (n - d10 * 1000000000 - d9 * 100000000 - d8 * 10000000 - d7 * 1000000 - d6 * 100000 - d5 * 10000 - d4 * 1000 - d3 * 100 - d2 * 10);

    return d10 + d9 + d8 + d7 + d6 + d5 + d4 + d3 + d2 + d1;

}
